# CAO Points

## Introduction

The CAO points data, available from the [CAO website](http://www.cao.ie), is published in a different format for each of the years 2019, 2020, and 2021. Each year's data, therefore, requires a different approach to acquisition, conversion to pandas dataframe, and cleaning. The 2019 data is published in two pdf files; one for level 8 courses, and one for levels 6 and 7. The 2020 data is published as an Excel spreadsheet, and the 2021 data as preformatted text in a HTML webpage.

The relevant columns are `Course Code`, `Course Name`, `Institution Name`, `EOS`, which is the number of points achieved by the last applicant to be offered a place on the course, and `Mid`, which is the mid point between the number of points held by the highest point score and the lowest point score of the applicants offered a place on the course [1].

## Acquiring the data

In [1]:
# imports
import pandas as pd
import matplotlib.pyplot as plt
from tabula import read_pdf
import requests
from requests.compat import urljoin

In [2]:
base_url = 'http://www2.cao.ie/points/'

# 2019 data is provided in PDF format
cao_2019_urls  = ('lvl8_19.pdf', 'lvl76_19.pdf')

# for each of the two points pdfs construct url, 
# fetch pdf, and write to working directory
for url in (cao_2019_urls):
    response = requests.get(urljoin(base_url, url))
    with open(url, 'wb') as f:
        f.write(response.content)

In [7]:
# read the entire pdf, extracting tables into a single dataframe
df = read_pdf("lvl8_19.pdf", pages="all", multiple_tables=False)[0]
df.head()

  Course Code                             INSTITUTION and COURSE  EOS  Mid
0         NaN                    Athlone Institute of Technology  NaN  NaN
1       AL801    Software Design with Virtual Reality and Gaming  304  328
2       AL802               Software Design with Cloud Computing  301  306
3       AL803  Software Design with Mobile Apps and Connected...  309  337
4       AL805        Network Management and Cloud Infrastructure  329  442

In [8]:
# Create a new column in the dataframe for institution name 
# identify institution name rows as those containing null course codes
# and add those institution names to the new institution column
df['Institution'] = df[df['Course Code'].isnull()]['INSTITUTION and COURSE']
df.rename(columns={'INSTITUTION and COURSE':'Course Name'}, inplace=True)
df.head()

,Course Code,Course Name,EOS,Mid,Institution
0,NaN,Athlone Institute of Technology,NaN,NaN,Athlone Institute of Technology
1,AL801,Software Design with Virtual Reality and Gaming,304,328,NaN
2,AL802,Software Design with Cloud Computing,301,306,NaN
3,AL803,Software Design with Mobile Apps and Connected...,309,337,NaN
4,AL805,Network Management and Cloud Infrastructure,329,442,NaN

In [9]:
# Fill empty fields in the institution column with the most recent non-na field
df['Institution'] = df['Institution'].fillna(method='ffill')
df.head()

,Course Code,Course Name,EOS,Mid,Institution
0,NaN,Athlone Institute of Technology,NaN,NaN,Athlone Institute of Technology
1,AL801,Software Design with Virtual Reality and Gaming,304,328,Athlone Institute of Technology
2,AL802,Software Design with Cloud Computing,301,306,Athlone Institute of Technology
3,AL803,Software Design with Mobile Apps and Connected...,309,337,Athlone Institute of Technology
4,AL805,Network Management and Cloud Infrastructure,329,442,Athlone Institute of Technology

In [10]:
# Finally, remove rows containing only institution names
df = df[df['Course Code'].notna()]
df.head()

,Course Code,Course Name,EOS,Mid,Institution
1,AL801,Software Design with Virtual Reality and Gaming,304,328,Athlone Institute of Technology
2,AL802,Software Design with Cloud Computing,301,306,Athlone Institute of Technology
3,AL803,Software Design with Mobile Apps and Connected...,309,337,Athlone Institute of Technology
4,AL805,Network Management and Cloud Infrastructure,329,442,Athlone Institute of Technology
5,AL810,Quantity Surveying,307,349,Athlone Institute of Technology

## Analysing the data

In [17]:
df.describe()

,Course Code,Course Name,EOS,Mid,Institution
count,930,930,926,915,930
unique,930,718,357,279,35
top,AL801,Accounting and Finance,300,543,Technological University Dublin City Campus
freq,1,11,32,14,69

In [11]:
dfg = df.sort_values('EOS')

In [20]:
print(dfg.head(100))

    Course Code                                        Course Name     EOS  \
529       DN301               Veterinary Medicine - Graduate Entry       #
534       DN411                       Radiography - Graduate Entry       #
381       GC494                            Fashion Design (Dublin)       #
859       MH803  Local Studies or Community Studies (part-time,...       #
858       MH802    Community and Youth Work (part-time, in service       #
832       MH116               Community and Youth Work (Full-Time)       #
828       MH103                                              Music       #
123       CK115               Social Work - Mature Applicants only       #
122       CK114  Social Science (Youth and Community Work) - 3 ...       #
334       DT533                        Contemporary Visual Culture       #
924       TL889  Counselling with Addiction - Mature applicants...       #
436       AD211                                     Fashion Design  # +mat
435       AD204                                           Fine Art  # +mat
434       AD202  Education & Design or Fine Art (Second Level T...  # +mat
433       AD103   Textile & Surface Design and Jewellery & Objects  # +mat
440       AD222                                 Interaction Design  # +mat
432       AD102             Graphic Design and Moving Image Design  # +mat
437       AD212                                     Product Design  # +mat
439       AD217                                       Illustration  # +mat
431       AD101             First Year Art & Design (Common Entry)  # +mat
380       GC489                     Interior Architecture (Dublin)    #267
934       WD027                                              Music    #290
782       LM026                Performing Arts (audition required)    #307
699       LY408                              Design (Common Entry)    #307
808       LM103       Paramedic Studies (B and C1 Drivers Licence)    #313
214       DC005  Education - Primary Teaching - Irish Sign Lang...    #316
120       CK112  Theatre and Performative Practices - 3 or 4 ye...    #324
113       CK104  Arts with Music - 3 or 4 years (BMus or Chines...    #340
879       SG244                                           Fine Art    #355
213       DC004  Education - Primary Teaching (Church of Irelan...    #357
218       DC012  Post Primary Teacher Education - Religious Edu...    #367
332       DT529                                Drama (Performance)    #371
508       TR093       General Nursing (Adelaide School of Nursing)   #378*
326       DT501                                              Music    #383
794       LM076  Product Design and Technology (portfolio requi...    #402
456       TR002                                              Music    #414
804       LM099                  Architecture (portfolio required)    #419
180       CM002  Education - Primary Teaching - Gaeltacht Appli...    #421
220       DC014      BA in Jazz and Contemporary Music Performance    #428
462       TR009                                    Music Education    #430
212       DC003  Education - Primary Teaching - Gaeltacht Appli...    #433
826       MH002  Education - Primary Teaching - Gaeltacht Appli...   #441*
717       MI006  Education - Primary Teaching (Gaeltacht Applic...    #442
328       DT506                            Commercial Modern Music    #468
664       GY261  Business Studies (International Hotel Manageme...    #486
474       TR025                          Drama and Theatre Studies    #489
181       CM003  Oideachas - Bunmhúinteoireacht Trí Mheán na Ga...    #491
182       CM004  Oideachas - Bunmhúinteoireacht Trí Mheán na Ga...    #492
564       DK860                                              Music    #499
80        CR130                                    Musical Theatre    #500
806       LM101       Medicine  - Graduate Entry (GAMSAT required)    #55*
335       DT544                                    Interior Design    #552
528       DN300          Veterinary Medicine - Undergraduate Entry    #567
172       CK791       Medicine  - Graduate Entry (GAMSAT required)    #58*
351       DL827                                                Art    #583
77        CR127  Popular Music: Electric Guitar at CIT Cork Sch...    #584
107       CR600                              Visual Communications    #587
532       DN401        Medicine - Graduate Entry (GAMSAT required)    #59*
454       RC101        Medicine - Graduate Entry (GAMSAT required)     #60
24        AL861             Animation and Illustration (portfolio)    #615
280       DT101                  Architecture (test and interview)    #618
83        CR220  Fine Art at CIT Crawford College of Art and De...    #620
74        CR121                  Music at CIT Cork School of Music    #633
357       DL833                                        Photography    #636
336       DT545                      Design - Visual Communication    #667
337       DT546                                           Fine Art    #668
665       GY262  Commerce (International Hotel Management, Shan...    #671
352       DL828             3D Design, Modelmaking and Digital Art    #691
339       DT559                                        Photography    #700
58        CW858  Sports Management and Coaching (options, portf...    #700
31        CW038                           Art (portfolio, Wexford)    #700
25        AL863             Graphic and Digital Design (portfolio)    #703
686       GY501  Medicine (five year/six year course, HPAT requ...   #726*
160       CK701     Medicine (Undergraduate Entry - HPAT required)    #729
451       RC001     Medicine - Undergraduate Entry (HPAT required)    #729
486       TR051                           Medicine (HPAT required)    #730
728       LC110           Art and Design (Common Entry, portfolio)    #734
531       DN400     Medicine - Undergraduate Entry (HPAT required)    #735
350       DL826                        Visual Communication Design    #736
362       DL838                          Creative Music Production    #746
109       CR700  Theatre and Drama Studies at CIT Cork School o...    #768
776       LC518  Digital Animation Production (Clonmel, portfolio)    #816
353       DL829       Design for Stage and Screen (Costume Design)    #817
774       LC502           Game Art and Design (Clonmel, portfolio)    #838
78        CR128  Popular Music: Keyboards at CIT Cork School of...    #839
356       DL832                                          Animation    #855
79        CR129   Popular Music: Voice at CIT Cork School of Music    #857
76        CR126   Popular Music: Drums at CIT Cork School of Music    #878
354       DL830        Design for Stage and Screen (Makeup Design)    #879
355       DL831    Design for Stage and Screen (Production Design)    #893
729       LC114  Fashion and Textiles for Product and Costume (...    #900
84        CR225                         Photography with New Media    #920
358       DL834                     Film and Television Production    #933
75        CR125  Popular Music: Electric Bass Guitar at CIT Cor...    #972
82        CR210  Contemporary Applied Art (Ceramics, Glass, Tex...    #979
65        PC411  English and History (fulfils Teaching Council ...     168
372       GC401                    Accounting and Finance (Dublin)     181
206       DB567                                               Film     192
424       TA322                                          Computing     200
413       TA121                             Accounting and Finance     202

        Mid                                        Institution
529     NaN                    University College Dublin (NUI)
534     NaN                    University College Dublin (NUI)
381     NaN                                   Griffith College
859     NaN                                Maynooth University
858     NaN                                Maynooth University
832     271                                Maynooth University
828     367                                Maynooth University
123     NaN                      University College Cork (NUI)
122     NaN                      University College Cork (NUI)
334     NaN        Technological University Dublin City Campus
924     NaN                    Institute of Technology, Tralee
436  ic 600                 National College of Art and Design
435  ic 600                 National College of Art and Design
434  ic 580                 National College of Art and Design
433  ic 545                 National College of Art and Design
440  ic 657                 National College of Art and Design
432  ic 635                 National College of Art and Design
437  ic 600                 National College of Art and Design
439  ic 625                 National College of Art and Design
431  ic 550                 National College of Art and Design
380     361                                   Griffith College
934     317                  Waterford Institute of Technology
782     367                             University of Limerick
699     368                Letterkenny Institute of Technology
808     403                             University of Limerick
214     316                             Dublin City University
120     470                      University College Cork (NUI)
113     409                      University College Cork (NUI)
879     496                     Institute of Technology, Sligo
213     NaN                             Dublin City University
218     415                             Dublin City University
332     519        Technological University Dublin City Campus
508     409                             Trinity College Dublin
326     520        Technological University Dublin City Campus
794     466                             University of Limerick
456     473                             Trinity College Dublin
804     473                             University of Limerick
180     440                      Marino Institute of Education
220     590                             Dublin City University
462     465                             Trinity College Dublin
212     473                             Dublin City University
826     NaN                                Maynooth University
717     473                            Mary Immaculate College
328     835        Technological University Dublin City Campus
664     615             National University of Ireland, Galway
474     531                             Trinity College Dublin
181     506                      Marino Institute of Education
182     569                      Marino Institute of Education
564     649                    Dundalk Institute of Technology
80      600                       Cork Institute of Technology
806      57                             University of Limerick
335     866        Technological University Dublin City Campus
528     589                    University College Dublin (NUI)
172      59                      University College Cork (NUI)
351     902  Dun Laoghaire Institute of Art, Design and Tec...
77      761                       Cork Institute of Technology
107     888                       Cork Institute of Technology
532      61                    University College Dublin (NUI)
454      62               Royal College of Surgeons in Ireland
24      899                    Athlone Institute of Technology
280     647        Technological University Dublin City Campus
83      819                       Cork Institute of Technology
74     1052                       Cork Institute of Technology
357     791  Dun Laoghaire Institute of Art, Design and Tec...
336     897        Technological University Dublin City Campus
337     813        Technological University Dublin City Campus
665     726             National University of Ireland, Galway
352     866  Dun Laoghaire Institute of Art, Design and Tec...
339     926        Technological University Dublin City Campus
58      700                    Institute of Technology, Carlow
31      700                    Institute of Technology, Carlow
25      898                    Athlone Institute of Technology
686     731             National University of Ireland, Galway
160     740                      University College Cork (NUI)
451     733               Royal College of Surgeons in Ireland
486     739                             Trinity College Dublin
728     918                   Limerick Institute of Technology
531     745                    University College Dublin (NUI)
350     989  Dun Laoghaire Institute of Art, Design and Tec...
362     873  Dun Laoghaire Institute of Art, Design and Tec...
109     906                       Cork Institute of Technology
776     962                   Limerick Institute of Technology
353    1021  Dun Laoghaire Institute of Art, Design and Tec...
774     950                   Limerick Institute of Technology
78     1009                       Cork Institute of Technology
356    1055  Dun Laoghaire Institute of Art, Design and Tec...
79      927                       Cork Institute of Technology
76     1043                       Cork Institute of Technology
354     953  Dun Laoghaire Institute of Art, Design and Tec...
355    1073  Dun Laoghaire Institute of Art, Design and Tec...
729     988                   Limerick Institute of Technology
84      920                       Cork Institute of Technology
358    1011  Dun Laoghaire Institute of Art, Design and Tec...
75     1021                       Cork Institute of Technology
82      979                       Cork Institute of Technology
65      289                      Carlow College, St. Patrick`s
372     309                                   Griffith College
206     295                             Dublin Business School
424     294    Technological University Dublin Tallaght Campus
413     328    Technological University Dublin Tallaght Campus

## Conclusion

In [19]:
pd.set_option("display.max_rows", None)

## References

[1] https://www.independent.ie/life/family/learning/understanding-your-cao-course-guide-26505318.html